package demo01.service;

public class Data {
    public static final int EMPLOYEE = 10;
    public static final int PROGRAMMER = 11;
    public static final int DESIGNER = 12;
    public static final int ARCHITECT = 13;

    public static final int PC = 21;
    public static final int NOTEBOOK = 22;
    public static final int PRINTER = 23;

    public static final String[][] EMPLOYEES = {
            {"10","1","马云","22","3000"},
            {"13","2","马化腾","32","8000","15000","2000"},
            {"11","3","李彦宏","23","13000"},
            {"11","4","刘强东","25","23000"},
            {"12","5","雷军","35","13000","5000"},
            {"11","6","任志强","31","32000"},
            {"12","7","柳传志","29","8000","7000"},
            {"13","8","杨元庆","26","12000","12000","2500"},
            {"12","9","史玉柱","27","13000","5600"},
            {"11","10","丁磊","26","15000"},
            {"11","11","张朝阳","23","5600"},
            {"12","12","杨致远","22","9000","4800"},
            {"13","13","小黑","22","12000","12000","2500"}
    };
    public static final String[][] EQUIPMENTS={
            {},
            {"22","联想T4","6000"},
            {"21","戴尔","NEC 17寸"},
            {"21","戴尔","三星17寸"},
            {"23","性能2900","激光"},
            {"21","华硕","三星17寸"},
            {"21","华硕","三星17寸"},
            {"23","爱普生20K","针式"},
            {"22","惠普M6","5800"},
            {"21","戴尔","NEC 17寸"},
            {"21","华硕","三星17寸"},
            {"22","惠普M6","5800"},
            {"21","华硕","三星17寸"}
    };
}
